


Network Working Group                                          A. Morton
Internet-Draft                                             L. Ciavattone
Intended status: Standards Track                               AT&T Labs
Expires: September 7, 2009                                 March 6, 2009


                      TWAMP Reflect Octets Feature
                draft-ietf-ippm-twamp-reflect-octets-01

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.  This document may contain material
   from IETF Documents or IETF Contributions published or made publicly
   available before November 10, 2008.  The person(s) controlling the
   copyright in some of this material may not have granted the IETF
   Trust the right to allow modifications of such material outside the
   IETF Standards Process.  Without obtaining an adequate license from
   the person(s) controlling the copyright in such materials, this
   document may not be modified outside the IETF Standards Process, and
   derivative works of it may not be created outside the IETF Standards
   Process, except to format it for publication as an RFC or to
   translate it into languages other than English.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 7, 2009.

Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal



Morton & Ciavattone     Expires September 7, 2009               [Page 1]

Internet-Draft            TWAMP Reflect Octets                March 2009


   Provisions Relating to IETF Documents in effect on the date of
   publication of this document (http://trustee.ietf.org/license-info).
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.

Abstract

   The IETF has completed its work on the core specification of TWAMP -
   the Two-Way Active Measurement Protocol.  This memo describes a new
   feature for TWAMP: an optional capability where the responder host
   returns some of the command octets or padding octets to the
   controller, and/or ensures that the same test packet sizes are used
   in both directions.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].
































Morton & Ciavattone     Expires September 7, 2009               [Page 2]

Internet-Draft            TWAMP Reflect Octets                March 2009


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Purpose and Scope  . . . . . . . . . . . . . . . . . . . . . .  4
   3.  TWAMP Control Extensions . . . . . . . . . . . . . . . . . . .  5
     3.1.  Connection Setup with Reflect Padding Feature  . . . . . .  5
     3.2.  Request-TW-Session Packet Format . . . . . . . . . . . . .  6
     3.3.  Accept Session Packet Format . . . . . . . . . . . . . . .  8
     3.4.  Additional considerations  . . . . . . . . . . . . . . . .  8
   4.  Extended TWAMP Test  . . . . . . . . . . . . . . . . . . . . .  9
     4.1.  Sender Behavior  . . . . . . . . . . . . . . . . . . . . .  9
       4.1.1.  Packet Timings . . . . . . . . . . . . . . . . . . . .  9
       4.1.2.  Packet Formats and Contents  . . . . . . . . . . . . .  9
       4.1.3.  Padding Truncation . . . . . . . . . . . . . . . . . . 11
     4.2.  Reflector Behavior . . . . . . . . . . . . . . . . . . . . 11
       4.2.1.  Packet Format and Contents . . . . . . . . . . . . . . 11
       4.2.2.  Padding Truncation . . . . . . . . . . . . . . . . . . 12
   5.  Possible Alternative . . . . . . . . . . . . . . . . . . . . . 13
   6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 15
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 15
     7.1.  Registry Specification . . . . . . . . . . . . . . . . . . 16
     7.2.  Registry Management  . . . . . . . . . . . . . . . . . . . 16
     7.3.  Experimental Numbers . . . . . . . . . . . . . . . . . . . 16
     7.4.  Registry Contents  . . . . . . . . . . . . . . . . . . . . 16
   8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 17
   9.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 17
     9.1.  Normative References . . . . . . . . . . . . . . . . . . . 17
     9.2.  Informative References . . . . . . . . . . . . . . . . . . 17
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 17






















Morton & Ciavattone     Expires September 7, 2009               [Page 3]

Internet-Draft            TWAMP Reflect Octets                March 2009


1.  Introduction

   The IETF has completed its work on the core specification of TWAMP -
   the Two-Way Active Measurement Protocol [RFC5357].  TWAMP is an
   extension of the One-way Active Measurement Protocol, OWAMP
   [RFC4656].  The TWAMP specification gathered wide review as it
   approached completion, and the by-products were several
   recommendations for new features in TWAMP.  There are a growing
   number TWAMP implementations at present, and wide-spread usage is
   expected.  There are even devices that are designed to test
   implementations for protocol compliance.

   This memo describes a new feature for TWAMP.  This feature adds the
   OPTIONAL capability for the responder host to return a limited number
   of unassigned (padding) octets to the Control-Client or Session-
   Sender entities.  With this capability, the Control-Client or
   Session-Sender can embed octets of information it deems useful and
   have the assurance that the corresponding reply/test packet will
   contain that information when it is reflected and returned (by the
   Server or Session-Reflector.  The feature also adds the Session-
   Reflector capability to assure that reflected test packets SHALL have
   their padding octets truncated, so that TWAMP-Test protocol uses the
   same packet size in both directions of transmission.

   The relationship between this memo and TWAMP is intended to be an
   update to [RFC5357] when published.


2.  Purpose and Scope

   The purpose of this memo is to describe a new feature for TWAMP
   [RFC5357].  The feature enhances the TWAMP responder's capabilities
   to perform simple operations on control and test packets: the
   reflection of octets or padding and the guaranteed truncation of
   padding to compensate for the different sizes of TWAMP fields in the
   test packets.  Motivations include permitting the controller host to
   tag packets with an index for simplified identification, and/or
   assert that the same size test packets MUST be used in each
   direction.

   The scope of the memo is currently limited to specifications of the
   following feature:

   o  Extension of the modes of operation through assignment of new
      values in the Mode Field (see section 3.1 [RFC4656] for the format
      of the Server Greeting message), while retaining backward
      compatibility with the core TWAMP [RFC5357] implementations.
      These two values identify the ability of the Server/



Morton & Ciavattone     Expires September 7, 2009               [Page 4]

Internet-Draft            TWAMP Reflect Octets                March 2009


      Session-Reflector to reflect specific octets back to the Client/
      Session-Sender, and/or to truncate padding octets and ensure that
      TWAMP-Test protocol uses the same packet size in both directions.


3.  TWAMP Control Extensions

   TWAMP-Control protocol [RFC5357] uses the Modes Field to identify and
   select specific communication capabilities, and this field is a
   recognized extension mechanism.  The following sections describe one
   such extension.

3.1.  Connection Setup with Reflect Padding Feature

   TWAMP connection establishment follows the procedure defined in
   section 3.1 of [RFC4656] and section 3.1 of [RFC5357].  The new
   feature requires two new bit positions (and values) to identify the
   ability of the Server/Session-Reflector to reflect specific octets
   back to the Control-Client/Session-Sender, and to truncate padding
   octets when required.  With this added feature, the complete set of
   TWAMP Modes Field bit positions and values would be as follows:

   Value  Description             Reference/Explanation
   0      Reserved
   1      Unauthenticated         RFC4656, Section 3.1
   2      Authenticated           RFC4656, Section 3.1
   4      Encrypted               RFC4656, Section 3.1
   8      Unauth. TEST protocol,  draft-ietf-more-twamp (3)
          Encrypted CONTROL
   --------------------------------------------------------
   xxx    Reflect Octets          new bit position (X)
          Capability
   yyy    Truncate Padding        new bit position (Y)
          Capability


   In the original OWAMP Modes Field, setting bit positions 0, 1 or 2
   indicated the security mode of the Control protocol, and the Test
   protocol inherited the same mode (see section 4 of [RFC4656]).  In
   the memo [I-D.ietf-ippm-more-twamp], bit position 3 allows
   unauthenticated TWAMP Test protocol to be used with encryption on the
   TWAMP-Control protocol.

   The Server sets one or both of the new bit positions (X and Y) in the
   Modes Field of the Server Greeting message to indicate its
   capabilities and willingness to operate in these modes if desired.
   >>>IANA: change X and Y to the assigned values <<<




Morton & Ciavattone     Expires September 7, 2009               [Page 5]

Internet-Draft            TWAMP Reflect Octets                March 2009


   If the Control-Client intends to operate all test sessions invoked
   with this control connection using one or both of the new modes, it
   MUST set the Modes Field bit corresponding to that function in the
   Setup Response message.

3.2.  Request-TW-Session Packet Format

   The bits designated for the Reflect Octets feature in the Request-TW-
   Session command are as shown in the packet format below.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      5        |  MBZ  | IPVN  |  Conf-Sender  | Conf-Receiver |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  Number of Schedule Slots                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                                                               .
   .           ... Many fields (66 octets) not shown ...           .
   .                                                               .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Padding Length                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Start Time, (8 octets)                   |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Timeout, (8 octets)                     |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Type-P Descriptor                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Octets to be reflected    |  Length of padding to reflect |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       MBZ (4 octets)                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                       HMAC (16 octets)                        |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The "Padding Length" Field *continues* to specify the number of
   padding octets that the Session-Sender will append to ALL TWAMP-Test
   packets associated with this test session.  See below for
   considerations on the minimum length of the padding octets,
   especially when complying with the options described in this memo,
   following the definitions of the two new fields that follow the



Morton & Ciavattone     Expires September 7, 2009               [Page 6]

Internet-Draft            TWAMP Reflect Octets                March 2009


   Type-P Descriptor.

   Note that the number of padding octets appended to the Session-
   Reflector's test packet depends on support for the OPTIONAL Truncate
   Padding mode, or the RECOMMENDED truncation process in TWAMP section
   4.2.1 [RFC5357].

   The "Octets to be reflected" Field SHALL be 2 octets long, as shown
   and contains the octets that the Server MUST reflect in the Accept
   Session message as specified below.

   The "Length of padding to reflect" Field SHALL be 2 octets long, and
   contain an unsigned binary value in units of octets.  This field
   communicates the length of the padding in the TWAMP-Test Packet that
   the Session-Sender expects to be reflected, and the length of octets
   that the Session-Reflector SHALL return in include in its TWAMP-Test
   packet format (see section 4.2).  By including this length field in
   the Request-TW-Session message, a Server is able to determine if it
   can comply with a specific request to reflect padding in the TWAMP-
   Test packets, and to arrange for the Session-Reflector processing in
   advance.

   The "Padding Length" SHOULD be >= 27 octets when specifying a test
   session using the Unauthenticated TWAMP-Test mode, to allow for the
   RECOMMENDED truncation process in TWAMP section 4.2.1 [RFC5357].

   The "Padding Length" SHOULD be >= 56 octets when specifying a test
   session using the Authenticated or Encrypted TWAMP-Test modes, to
   allow for the RECOMMENDED truncation process in TWAMP section 4.2.1
   [RFC5357].

   The "Padding Length" SHALL be > the "Length of padding to reflect"
   when specifying a test session using the OPTIONAL Reflect Octets
   mode.

   The "Padding Length" SHALL be >= 27 + "Length of padding to reflect"
   octets when specifying a test session using BOTH the OPTIONAL Reflect
   Octets mode and OPTIONAL Truncate Padding mode with the
   Unauthenticated TWAMP-Test mode.

   The "Padding Length" SHALL be >= 56 + "Length of padding to reflect"
   octets when specifying a test session using BOTH the OPTIONAL Reflect
   Octets mode and OPTIONAL Truncate Padding mode with the Authenticated
   or Encrypted TWAMP-Test modes.







Morton & Ciavattone     Expires September 7, 2009               [Page 7]

Internet-Draft            TWAMP Reflect Octets                March 2009


3.3.  Accept Session Packet Format

   The bits designated for the Reflect Padding feature in the Accept
   Session command are as shown in the packet format below.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Accept     |      MBZ      |            Port               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-|
   |                                                               |
   |                        SID (16 octets)                        |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Reflected octets        |         Server octets         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       MBZ (8 octets)                          |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                       HMAC (16 octets)                        |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   The "Reflected octets" field SHALL contain the octets from the
   Request-TW-Session "Octets to be reflected" Field, and be 2 octets
   long, as shown.

   The "Server octets" field SHALL contain information that the Server
   intends to be returned in the TWAMP-Test packet padding to-be-
   reflected Field, OR SHALL be zero, and be 2 octets long, as shown.
   Although the Server determines the SID, this field is very long (16
   octets) and does not normally appear in TWAMP-Test packets.

   In Truncate Padding mode, IF calculations on the Padding lengths
   reveal that there are insufficient octets supplied to produce equal-
   length Session-Sender and Session-Reflector test packets, then the
   Accept Field MUST be set to 3 = some aspect of the request is not
   supported.

3.4.  Additional considerations

   The value of the Modes Field sent by the Server in the Server
   Greeting message is the bit-wise OR of the mode values that it is
   willing to support during this session.



Morton & Ciavattone     Expires September 7, 2009               [Page 8]

Internet-Draft            TWAMP Reflect Octets                March 2009


   Thus, the last six bits of the Modes 32-bit Field are used.  A client
   conforming to this extension of [RFC5357] MAY ignore the values in
   the first 24 bits of the Modes Field, or it MAY support other
   features that are communicated in these bit positions.  (The first 24
   bits are available for future protocol extensions.)

   Other ways in which TWAMP extends OWAMP are described in [RFC5357].


4.  Extended TWAMP Test

   The TWAMP test protocol is similar to the OWAMP [RFC4656] test
   protocol with the exception that the Session-Reflector transmits test
   packets to the Session-Sender in response to each test packet it
   receives.  TWAMP section 4[RFC5357] defines two additional test
   packet formats for packets transmitted by the Session-Reflector.  The
   appropriate format depends on the security mode chosen.  The new
   modes specified here utilize some of the padding octets within each
   test packet format, or require truncation of those octets depending
   on the security mode in use.

4.1.  Sender Behavior

   This section describes extensions to the behavior of the TWAMP
   Session-Sender.

4.1.1.  Packet Timings

   The Send Schedule is not utilized in TWAMP, and this is unchanged in
   this memo.

4.1.2.  Packet Formats and Contents

   The Session-Sender packet format and content follow the same
   procedure and guidelines as defined in section 4.1.2 of [RFC4656] (as
   indicated in section 4.1.2 of TWAMP [RFC5357]).

   The Reflect octets mode re-designates the original TWAMP-Test (and
   OWAMP-Test) Packet Padding Field (see section 4.1.2 of [RFC4656]), as
   shown below for unauthenticated mode:











Morton & Ciavattone     Expires September 7, 2009               [Page 9]

Internet-Draft            TWAMP Reflect Octets                March 2009


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Sequence Number                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Timestamp                            |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |         Error Estimate        |          MBZ (2 octets)       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                  Packet Padding (to be reflected)             |
   .               (length in octets specified elsewhere)          .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                                                               .
   .                  Additional Packet Padding                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The "Packet Padding (to be reflected)" Field SHALL correspond to the
   length of octets specified in the Request-TW-Session "Length of
   padding to reflect" Field to this test session.  These are the octets
   that the Session-Sender expects will be returned by the Session-
   Reflector.

   The length of the "Additional Packet Padding" Field is the difference
   between two fields in the Request-TW-Session command, as follows:

   "Additional Packet Padding", in octets =

   "Padding Length" - "Length of padding to reflect"

   One possible use of the first 4 octets of the "Packet Padding (to be
   reflected)" Field is shown below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Client octets          |         Server octets         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                  Packet Padding (to be reflected)             |
   .               (length in octets specified elsewhere)          .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   In this example, the "Client octets" and the "Server octets" fields
   contain the same information that the Client and Server exchanged in
   the Request-TW-Session and Accept-Session messages corresponding to
   this specific test session.  These octets would be reflected the same
   as the rest of the "Packet Padding (to be reflected)" Field.



Morton & Ciavattone     Expires September 7, 2009              [Page 10]

Internet-Draft            TWAMP Reflect Octets                March 2009


4.1.3.  Padding Truncation

   When the Truncate Padding mode is selected and communicated in the
   Setup Response message, the Session-Sender MUST anticipate a minimum
   padding required to achieve equal size test packets in both
   directions.  The amount of padding needed depends on BOTH the
   security mode (Unauthenticated/Authenticated/Encrypted) and whether
   the Reflect Octets mode is selected simultaneously.

   When using the Truncate Padding mode, the Session-Sender MUST append
   sufficient Packet Padding octets to allow the same IP packet payload
   lengths to be used in each direction of transmission (this is usually
   desirable).  To compensate for the Session-Reflector's larger test
   packet format, the Session-Sender MUST append at least 27 octets of
   padding in Unauthenticated mode, and at least 56 octets in
   Authenticated and Encrypted modes.

   When using the Reflect Octets mode simultaneously with the Truncate
   Padding mode, the Session-Sender MUST append at least 27 octets of
   padding plus the "Length of the padding to reflect" octets when
   operating in Unauthenticated mode.  The Session-Sender MUST append at
   least 56 octets of padding plus the "Length of the padding to
   reflect" octets when operating in Authenticated and Encrypted modes.

4.2.  Reflector Behavior

   The TWAMP Reflector follows the procedures and guidelines in section
   4.2 of [RFC5357], with the following additional functions:

   o  Reflect Octets mode: Designated octets in the "Packet Padding (to
      be reflected)" field of the Session-Sender's test packet MUST be
      included in the Session-Reflector's test packet.

   o  Truncate Padding mode: Octets in the packet padding field of the
      Session-Sender's test packet MUST be truncated so that the length
      of the Session-Reflector's test packet equals the length of the
      Session-Sender's test packet.

4.2.1.  Packet Format and Contents

   The Reflect Padding feature re-designates the packet padding field,
   as shown below for unauthenticated mode:









Morton & Ciavattone     Expires September 7, 2009              [Page 11]

Internet-Draft            TWAMP Reflect Octets                March 2009


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                        Sequence Number                        |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                          Timestamp                            |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |         Error Estimate        |           MBZ                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                          Receive Timestamp                    |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                        Sender Sequence Number                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                      Sender Timestamp                         |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |      Sender Error Estimate    |           MBZ                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  Sender TTL   |         Packet Padding (from Session-Sender)  |
    +-+-+-+-+-+-+-+-+                                               +
    .                                                               .
    .               Packet Padding (from Session-Sender)            .
    +               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |               |                                               |
    +-+-+-+-+-+-+-+-+                                               +
    .                  Additional Packet Padding                    .
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   The "Packet Padding (from Session-Sender)" field MUST be the same
   octets as the "Packet Padding (to be reflected)" field in the
   Session-Sender's test packet, and therefore MUST conform to the
   length specified in the Request-TW-Session message.

   IF the test packet length is truncated within the padding fields in
   conformance with the RECOMMENDED truncation process in TWAMP section
   4.2.1 [RFC5357], THEN ALL padding designated to be reflected MUST be
   reflected by Session-Reflectors using this feature.

4.2.2.  Padding Truncation

   Note that the Session-Reflector Test Packet Formats are larger than
   the Sender's formats.  When the Truncate Padding mode is selected and
   communicated in the Setup Response message, the Session-Reflector
   must truncate a specific number of padding octets to achieve equal
   size test packets in both directions.  The number of octets truncated
   depends on BOTH the security mode (Unauthenticated/Authenticated/
   Encrypted) and whether the Reflect octets mode is selected



Morton & Ciavattone     Expires September 7, 2009              [Page 12]

Internet-Draft            TWAMP Reflect Octets                March 2009


   simultaneously.

   When using the Truncate Padding mode, the Session-Reflector MUST
   truncate exactly 27 octets of padding in Unauthenticated mode, and
   exactly 56 octets in Authenticated and Encrypted modes.  The Session-
   Reflector MAY re-use the Sender's Packet Padding (since the
   requirements for padding generation are the same for each), and in
   this case the Session-Reflector MUST truncate the padding such that
   the highest number octets are discarded.

   When simultaneously using the Truncate Padding mode AND Reflect
   octets mode, the Session-Reflector MUST reflect the designated octets
   from the Session-Sender's test packet in the "Packet Padding (from
   Session-Sender)" Field, and MAY re-use additional Packet Padding from
   the Session-Sender.  The Session-Reflector MUST truncate the padding
   such that the highest number octets are discarded, and the test
   packet length equals the Session-Sender's packet length.


5.  Possible Alternative

   If new TWAMP-Test packet formats are defined, the Reflect Octets and
   Truncate Padding modes could be folded into one new mode.

   It would be possible to obtain even 4 octet boundaries in the revised
   format.

   It is also possible to simplfy test packet reflection by leaving the
   Session-Sender's fields exactly as received, and replacing the
   Discard Fill Field with the new time stamps and sequence number
   determined by the Session-Reflector.

   No calculations on padding are needed, and symmetrical packet size is
   ensured for both directions of transmssion.

   The "Packet Padding (to be reflected)" Field could contain
   information that is TLV encoded, but in general the padding is opaque
   to the Session-Reflector.

   This Alternative is illustrated for discussion purposes.

   New Session-Sender Test Packet Format:









Morton & Ciavattone     Expires September 7, 2009              [Page 13]

Internet-Draft            TWAMP Reflect Octets                March 2009


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Sequence Number                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Timestamp                            |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |         Error Estimate        |          MBZ (2 octets)       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                                                               |
   |                                                               |
   |                      Discard Fill                             |
   |                                                               |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                  Packet Padding (to be reflected)             |
   .               (length in octets specified elsewhere)          .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                                                               .
   .                  Additional Packet Padding                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   The "Discard Fill" octets are discarded at the Session-Reflector.

   New Session-Reflector Test Packet format:






















Morton & Ciavattone     Expires September 7, 2009              [Page 14]

Internet-Draft            TWAMP Reflect Octets                March 2009


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                     Sender Sequence Number                    |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                       Sender Timestamp                        |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |      Sender  Error Estimate   |           MBZ                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                  Reflector Receive Timestamp                  |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                    Reflector Sequence Number                  |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                  Reflector's Sending  Timestamp               |
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |      Sender Error Estimate    |           MBZ                 |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |  Sender TTL   |                      MBZ (3 octets)           |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    .                                                               .
    .               Packet Padding (from Session-Sender)            .
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    .                  Additional Packet Padding                    .
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


6.  Security Considerations

   These extended modes of operation do not appear to permit any new
   attacks on hosts communicating with core TWAMP [RFC5357] ???

   The security considerations that apply to any active measurement of
   live networks are relevant here as well.  See [RFC4656] and
   [RFC5357].


7.  IANA Considerations

   This memo adds two mode combinations to the IANA registry for the
   TWAMP Modes Field, and describes behavior when the new modes are
   used.  This field is a recognized extension mechanism for TWAMP.






Morton & Ciavattone     Expires September 7, 2009              [Page 15]

Internet-Draft            TWAMP Reflect Octets                March 2009


7.1.  Registry Specification

   IANA has created a TWAMP-Modes registry (as requested in
   [I-D.ietf-ippm-more-twamp]).  TWAMP-Modes are specified in TWAMP
   Server Greeting messages and Set-up Response messages, as described
   in section 3.1 of [RFC5357], consistent with section 3.1 of
   [RFC4656], and extended by this memo.  Modes are indicated by setting
   bits in the 32-bit Modes field.  Thus, this registry can contain a
   total of 32 possible values.

7.2.  Registry Management

   Because the Modes registry can contain only thirty-two values, and
   because TWAMP is an IETF protocol, this registry must be updated only
   by "IETF Consensus" as specified in [RFC2434](an RFC documenting
   registry use that is approved by the IESG).  For the Modes registry,
   we expect that new features will be assigned using monotonically
   increasing bit positions and in the range [0-31] and the
   corresponding values, unless there is a good reason to do otherwise.

7.3.  Experimental Numbers

   No experimental values are currently assigned for the Modes Registry.

7.4.  Registry Contents

   TWAMP Modes Registry is recommended to be augmented as follows:

   Value  Description             Semantics Definition
   0      Reserved

   1      Unauthenticated         RFC4656, Section 3.1

   2      Authenticated           RFC4656, Section 3.1

   4      Encrypted               RFC4656, Section 3.1

   8      Unauth. TEST protocol,  draft-ietf-more-twamp (3)
          Auth. CONTROL
   --------------------------------------------------------
   xxx    Reflect Octets          this memo, section 3.1
          Capability              new bit position (X)
   yyy    Truncate Padding        this memo, section 3.1
          Capability              new bit position (Y)
   The suggested values are

   X=4, xxx=16




Morton & Ciavattone     Expires September 7, 2009              [Page 16]

Internet-Draft            TWAMP Reflect Octets                March 2009


   Y=5, yyy=32


8.  Acknowledgements

   The authors would like to thank Walt Steverson for helpful review and
   comments.


9.  References

9.1.  Normative References

   [I-D.ietf-ippm-more-twamp]
              Morton, A. and K. Hedayat, "More Features for TWAMP",
              draft-ietf-ippm-more-twamp-00 (work in progress),
              October 2008.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC2434]  Narten, T. and H. Alvestrand, "Guidelines for Writing an
              IANA Considerations Section in RFCs", BCP 26, RFC 2434,
              October 1998.

   [RFC4656]  Shalunov, S., Teitelbaum, B., Karp, A., Boote, J., and M.
              Zekauskas, "A One-way Active Measurement Protocol
              (OWAMP)", RFC 4656, September 2006.

   [RFC5357]  Hedayat, K., Krzanowski, R., Morton, A., Yum, K., and J.
              Babiarz, "A Two-Way Active Measurement Protocol (TWAMP)",
              RFC 5357, October 2008.

9.2.  Informative References

   [x]        "".















Morton & Ciavattone     Expires September 7, 2009              [Page 17]

Internet-Draft            TWAMP Reflect Octets                March 2009


Authors' Addresses

   Al Morton
   AT&T Labs
   200 Laurel Avenue South
   Middletown,, NJ  07748
   USA

   Phone: +1 732 420 1571
   Fax:   +1 732 368 1192
   Email: acmorton@att.com
   URI:   http://home.comcast.net/~acmacm/


   Len Ciavattone
   AT&T Labs
   200 Laurel Avenue South
   Middletown,, NJ  07748
   USA

   Phone: +1 732 420 1239
   Fax:
   Email: lencia@att.com
   URI:



























Morton & Ciavattone     Expires September 7, 2009              [Page 18]


